## Veri Manipülasyonu

## Numpy 

Numerical Python

- Bilimsel hesaplamalar için kullanılır.
- Arrayler / çok boyutlu arrayler ve matrisler üzerinde yüksek performanslı çalışma imkanı sağlar.
- Temelleri 1995'te (matrix-sig, Guido Van Rossum) atılmış nihai olarak 2005(Travis Oliphant) yılında hayata geçmiştir. 
- Listelere benzerdir, farkı; verimli veri saklama ve vektörel operasyonlardır.

In [1]:
import numpy as np

In [4]:
#numpy array'i çağırmak

a = np.array([1,2,3,4])
b = np.array([2,3,4,5])

In [3]:
a * b

array([ 2,  6, 12, 20])

#### Numpy Array'i Oluşturmak

Veri tipidir. Tıpkı listeler gibi.

In [13]:
# 0 dolu 

np.zeros(10, dtype = int)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [14]:
# 1 den oluşan 

np.ones((3,5), dtype = int)

array([[1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

In [16]:
# 3 ile dolu liste yapmak

np.full((3,5), 3)

array([[3, 3, 3, 3, 3],
       [3, 3, 3, 3, 3],
       [3, 3, 3, 3, 3]])

In [17]:
# 0 dan 31e kadar 3 arayla sayı oluştur

np.arange(0,31,3)

array([ 0,  3,  6,  9, 12, 15, 18, 21, 24, 27, 30])

In [19]:
#iki sayı arasında n kadar değer oluşturmak 

np.linspace(0,1,10)

array([0.        , 0.11111111, 0.22222222, 0.33333333, 0.44444444,
       0.55555556, 0.66666667, 0.77777778, 0.88888889, 1.        ])

In [21]:
#dağılımı kendiminizin belirlediği sayılar oluşturmak 
# ort 10 std 4 gibi

np.random.normal(10,4,(3,4))

array([[10.38996977,  5.15662122,  8.26833169,  2.64213453],
       [ 5.25453512,  4.58566416, 11.78541416,  6.24773029],
       [12.534119  ,  8.33083346, 16.83157859, 14.37100229]])

In [ ]:
# int değerlerden rastgele oluşturmak

np.random.randint(0,10,(3,4))

array([[6, 6, 4, 0],
       [6, 6, 6, 8],
       [5, 0, 7, 0]])

##### Numpy Array Özellikleri 

- **ndim**: Boyut Sayısı
- **shape**: Boyut Bilgisi
- **size**: Toplam Eleman SAyısı
- **dtype**: Array Veri Tipi

In [32]:
# 10 elemanlı 10'a kadar 

a = np.random.randint(10, size = 10)

In [33]:
a.ndim

1

In [34]:
a.shape

(10,)

In [35]:
a.size

10

In [37]:
a.dtype

dtype('int32')

In [38]:
# iki boyutlu oluşturma

b = np.random.randint(10, size = (3,5))

In [39]:
b

array([[7, 0, 3, 8, 5],
       [4, 2, 8, 7, 5],
       [6, 1, 0, 4, 8]])

In [41]:
b.ndim

2

In [42]:
b.size

15

In [44]:
b.shape

(3, 5)

In [45]:
b.dtype

dtype('int32')

#### Yeniden Şekillendirme ( Reshaping)

In [48]:
# Var olan bir numpy arrayini yeniden şekillendirme 

np.arange(1,10)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [49]:
np.arange(1,10).reshape((3,3))

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [52]:
#tek boyutlu bir vektördür

a = np.arange(1,10)

In [53]:
a.ndim

1

In [55]:
# iki boyutlu ancak tek liste gibi görünüyor çift [] lere dikkat.

b = a.reshape((1,9))

In [56]:
b.ndim

2

#### Array Birleştirme (Concantenation)

In [57]:
x = np.array([1,2,3])
y = np.array([4,5,6])

In [58]:
np.concatenate([x,y])

array([1, 2, 3, 4, 5, 6])

In [59]:
z = np.array([7,8,9])

In [60]:
np.concatenate([x,y,x])

array([1, 2, 3, 4, 5, 6, 1, 2, 3])

In [61]:
#iki boyut

In [62]:
a = np.array([[1,2,3,],
              [4,5,6]])

In [63]:
np.concatenate([a,a])

array([[1, 2, 3],
       [4, 5, 6],
       [1, 2, 3],
       [4, 5, 6]])

In [65]:
np.concatenate([a,a], axis = 0)

array([[1, 2, 3],
       [4, 5, 6],
       [1, 2, 3],
       [4, 5, 6]])

#### Array Ayırma (Splitting)

In [66]:
x = np.array([1,2,3,99,99,3,2,1])

In [67]:
np.split(x, [3,5])

[array([1, 2, 3]), array([99, 99]), array([3, 2, 1])]

In [68]:
a,b,c = np.split(x, [3,5])

In [69]:
a

array([1, 2, 3])

In [70]:
b

array([99, 99])

In [71]:
c

array([3, 2, 1])

In [72]:
# iki boyutlu ayırma 

m = np.arange(16).reshape(4,4)
m

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [73]:
np.vsplit(m, [2])

[array([[0, 1, 2, 3],
        [4, 5, 6, 7]]),
 array([[ 8,  9, 10, 11],
        [12, 13, 14, 15]])]

In [74]:
ust, alt = np.vsplit(m, [2])

In [75]:
ust

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [76]:
alt

array([[ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [77]:
m

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [78]:
#yatay bölme

In [79]:
np.hsplit(m,[2])

[array([[ 0,  1],
        [ 4,  5],
        [ 8,  9],
        [12, 13]]),
 array([[ 2,  3],
        [ 6,  7],
        [10, 11],
        [14, 15]])]

In [80]:
sag, sol = np.hsplit(m,[2])

In [81]:
sag

array([[ 0,  1],
       [ 4,  5],
       [ 8,  9],
       [12, 13]])

In [82]:
sol

array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15]])

#### Array Sıralama (Sorting)

In [89]:
v = np.array([2,1,4,3,5])

In [90]:
v

array([2, 1, 4, 3, 5])

In [85]:
# orjinal yapıyı bozmuyor  
np.sort(v)

array([1, 2, 3, 4, 5])

In [91]:
v

array([2, 1, 4, 3, 5])

In [92]:
# yapıyı komple değiştiriyor 
v.sort()

In [93]:
v

array([1, 2, 3, 4, 5])

In [94]:
# iki boyutlu array sıralama

m = np.random.normal (20,5, (3,3))

In [95]:
m

array([[29.82400586, 17.63974435, 16.13631185],
       [24.91324196, 19.82723341, 22.62772711],
       [19.89337053, 24.27559165, 22.66892367]])

In [96]:
# satırları sıralamak

np.sort(m, axis = 1)

array([[16.13631185, 17.63974435, 29.82400586],
       [19.82723341, 22.62772711, 24.91324196],
       [19.89337053, 22.66892367, 24.27559165]])

In [97]:
# sutunları sıralamak

np.sort(m, axis = 0)

array([[19.89337053, 17.63974435, 16.13631185],
       [24.91324196, 19.82723341, 22.62772711],
       [29.82400586, 24.27559165, 22.66892367]])

#### Index ile Elemanlara Erişmek

In [98]:
a = np.random.randint(10, size = 10)
a

array([2, 9, 9, 4, 9, 7, 7, 8, 5, 1])

In [99]:
a[0]

2

In [100]:
a[-1]

1

In [101]:
# 0.elemanı değiştirmek 

a[0] = 100

In [102]:
a

array([100,   9,   9,   4,   9,   7,   7,   8,   5,   1])

In [103]:
m = np.random.randint(10, size = (3,5)) 
m

array([[0, 9, 3, 1, 9],
       [9, 5, 6, 7, 2],
       [1, 7, 6, 2, 2]])

In [104]:
m[0,0]

0

In [105]:
m[1,2]

6

In [106]:
m[1,2] = 88

In [107]:
m

array([[ 0,  9,  3,  1,  9],
       [ 9,  5, 88,  7,  2],
       [ 1,  7,  6,  2,  2]])

In [108]:
# ondalıklı eklemek istersen normal sayı olarak ekler tipi sabit çünkü 

m[1,4] = 2.2 
m

array([[ 0,  9,  3,  1,  9],
       [ 9,  5, 88,  7,  2],
       [ 1,  7,  6,  2,  2]])

#### Slicing ile Elemanlara Erişmek / Array Alt Küme İşlemleri

In [109]:
a = np.arange(20,30)
a

array([20, 21, 22, 23, 24, 25, 26, 27, 28, 29])

In [110]:
a[0:3]

array([20, 21, 22])

In [111]:
# 0 dan 3 e kadar erişmek 

a[:3]

array([20, 21, 22])

In [112]:
# 3 ten 0 a kadar

a[3:]

array([23, 24, 25, 26, 27, 28, 29])

In [113]:
# 0. indexten başla 2 şer 2şer ilerle

a[0::2]

array([20, 22, 24, 26, 28])

In [114]:
# İki boyutlu slice işlemleri

In [115]:
m = np.random.randint(10, size= (5,5))

In [116]:
m

array([[7, 7, 7, 1, 0],
       [8, 7, 1, 3, 6],
       [0, 6, 8, 1, 9],
       [0, 6, 2, 1, 3],
       [0, 7, 1, 6, 0]])

In [117]:
#bütün satırları seç şu sutunda seç

m[:,0]

array([7, 8, 0, 0, 0])

In [118]:
m[:,1]

array([7, 7, 6, 6, 7])

In [119]:
# sutunlarda seç şu satırda

m[0,:]

array([7, 7, 7, 1, 0])

In [120]:
m[0:2, 0:3]

array([[7, 7, 7],
       [8, 7, 1]])

In [121]:
m[:,0:2]

array([[7, 7],
       [8, 7],
       [0, 6],
       [0, 6],
       [0, 7]])

#### Alt küme Üzerinde İşlem Yapmak

In [122]:
import numpy as np
a = np.random.randint(10, size =(5,5))
a

array([[8, 8, 4, 0, 1],
       [2, 1, 5, 6, 7],
       [8, 3, 6, 3, 5],
       [1, 3, 4, 8, 1],
       [2, 6, 4, 6, 5]])

In [123]:
alt_a = a[0:3, 0:2]
alt_a

array([[8, 8],
       [2, 1],
       [8, 3]])

In [124]:
alt_a[0,0] = 99999
alt_a[1,1] = 888

In [125]:
alt_a

array([[99999,     8],
       [    2,   888],
       [    8,     3]])

In [126]:
a

array([[99999,     8,     4,     0,     1],
       [    2,   888,     5,     6,     7],
       [    8,     3,     6,     3,     5],
       [    1,     3,     4,     8,     1],
       [    2,     6,     4,     6,     5]])

In [128]:
# ana listede de değişiklik yapar bunu yapmaması için copy ile ana kümedenn bağımsız hale getirmek gerekir

In [134]:
alt_b = m[0:3, 0:2].copy()
alt_b

array([[7, 7],
       [8, 7],
       [0, 6]])

In [135]:
alt_b[0,0] = 9999

In [136]:
alt_b

array([[9999,    7],
       [   8,    7],
       [   0,    6]])

In [137]:
m

array([[7, 7, 7, 1, 0],
       [8, 7, 1, 3, 6],
       [0, 6, 8, 1, 9],
       [0, 6, 2, 1, 3],
       [0, 7, 1, 6, 0]])

### Fancy Index ile Elemanlara Erişmek

In [139]:
v = np.arange(0, 30, 3)
v

array([ 0,  3,  6,  9, 12, 15, 18, 21, 24, 27])

In [140]:
v[1]

3

In [141]:
al_getir = [1,3,5]

In [142]:
v[al_getir]

array([ 3,  9, 15])

In [143]:
# iki boyutta fancy

In [144]:
m = np.arange(9).reshape((3,3))

In [145]:
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [146]:
satir = np.array([0,1])
sutun = np.array([1,2])

In [147]:
m[satir,sutun]

array([1, 5])

In [148]:
# basit index ile fancy index
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [149]:
m[0,[1,2]]

array([1, 2])

In [150]:
#slice ile fancy

In [151]:
m[0:, [1,2]]

array([[1, 2],
       [4, 5],
       [7, 8]])

#### Koşullu Eleman İşlemleri

In [152]:
v = np.array([1, 2, 3, 4, 5])

In [153]:
# burada sadece sorgu yapılıyor true veya false cevap donecek
v > 5

array([False, False, False, False, False])

In [154]:
v < 3

array([ True,  True, False, False, False])

In [156]:
# true olma durumuna gore elemanları getiriyor 

v[v < 3]

array([1, 2])

In [157]:
v[v > 3]

array([4, 5])

In [158]:
v[v == 3]

array([3])

In [159]:
# 3 dışındakileri getir 

v[v != 3]

array([1, 2, 4, 5])

In [161]:
v

array([1, 2, 3, 4, 5])

In [160]:
v * 2

array([ 2,  4,  6,  8, 10])

In [162]:
v / 5

array([0.2, 0.4, 0.6, 0.8, 1. ])

In [163]:
v**2

array([ 1,  4,  9, 16, 25], dtype=int32)

#### Matematiksel İşlemler 

"ufunc" aracılığıyla yapılıyor aslında arka planda

In [196]:
v = np.array([1, 2, 3, 4, 5])

In [165]:
v

array([1, 2, 3, 4, 5])

In [166]:
v - 1

array([0, 1, 2, 3, 4])

In [167]:
v*5/10 - 1

array([-0.5,  0. ,  0.5,  1. ,  1.5])

In [168]:
#ucuncu dereceden kuvvet alma

np.power(v,3)

array([  1,   8,  27,  64, 125], dtype=int32)

In [169]:
# v nin 2 ye bölümünden kalanı getir 

v % 2

array([1, 0, 1, 0, 1], dtype=int32)

In [170]:
#veya 

np.mod(v,2)

array([1, 0, 1, 0, 1], dtype=int32)

In [172]:
# mutlak değer almak 

np.absolute(np.array([-3]))

array([3])

In [173]:
np.sin(360)

0.9589157234143065

In [175]:
np.cos(180)

-0.5984600690578581

In [178]:
v = np.array([1,2,3])

In [179]:
np.log(v)

array([0.        , 0.69314718, 1.09861229])

In [180]:
np.log2(v)

array([0.       , 1.       , 1.5849625])

In [181]:
#numpyda bulunan matematiksel diğer fonksiyonlara nasıl ulaşırız?
# numpy cheat sheat i google da aratabilirsiniz. 
?np

Type:        module
String form: <module 'numpy' from 'C:\\Users\\furka\\anaconda3\\lib\\site-packages\\numpy\\__init__.py'>
File:        c:\users\furka\anaconda3\lib\site-packages\numpy\__init__.py
Docstring:
NumPy
=====

Provides
  1. An array object of arbitrary homogeneous items
  2. Fast mathematical operations over arrays
  3. Linear Algebra, Fourier Transforms, Random Number Generation

How to use the documentation
----------------------------
Documentation is available in two forms: docstrings provided
with the code, and a loose standing reference guide, available from
`the NumPy homepage <https://www.scipy.org>`_.

We recommend exploring the docstrings using
`IPython <https://ipython.org>`_, an advanced Python shell with
TAB-completion and introspection capabilities.  See below for further
instructions.

The docstring examples assume that `numpy` has been imported as `np`::

  >>> import numpy as np

Code snippets are indicated by three greater-than signs::

  >>> x = 42
  >>> x = x + 1

Use the built-in ``help`` function to view a function's docstring::

  >>> help(np.sort)
  ... # doctest: +SKIP

For some objects, ``np.info(obj)`` may provide additional help.  This is
particularly true if you see the line "Help on ufunc object:" at the top
of the help() page.  Ufuncs are implemented in C, not Python, for speed.
The native Python help() does not know how to view their help, but our
np.info() function does.

To search for documents containing a keyword, do::

  >>> np.lookfor('keyword')
  ... # doctest: +SKIP

General-purpose documents like a glossary and help on the basic concepts
of numpy are available under the ``doc`` sub-module::

  >>> from numpy import doc
  >>> help(doc)
  ... # doctest: +SKIP

Available subpackages
---------------------
doc
    Topical documentation on broadcasting, indexing, etc.
lib
    Basic functions used by several sub-packages.
random
    Core Random Tools
linalg
    Core Linear Algebra Tools
fft
    Core FFT routines
polynomial
    Polynomial tools
testing
    NumPy testing tools
f2py
    Fortran to Python Interface Generator.
distutils
    Enhancements to distutils with support for
    Fortran compilers support and more.

Utilities
---------
test
    Run numpy unittests
show_config
    Show numpy build configuration
dual
    Overwrite certain functions with high-performance SciPy tools.
    Note: `numpy.dual` is deprecated.  Use the functions from NumPy or Scipy
    directly instead of importing them from `numpy.dual`.
matlib
    Make everything matrices.
__version__
    NumPy version string

Viewing documentation using IPython
-----------------------------------
Start IPython with the NumPy profile (``ipython -p numpy``), which will
import `numpy` under the alias `np`.  Then, use the ``cpaste`` command to
paste examples into the shell.  To see which functions are available in
`numpy`, type ``np.<TAB>`` (where ``<TAB>`` refers to the TAB key), or use
``np.*cos*?<ENTER>`` (where ``<ENTER>`` refers to the ENTER key) to narrow
down the list.  To view the docstring for a function, use
``np.cos?<ENTER>`` (to view the docstring) and ``np.cos??<ENTER>`` (to view
the source code).

Copies vs. in-place operation
-----------------------------
Most of the functions in `numpy` return a copy of the array argument
(e.g., `np.sort`).  In-place versions of these functions are often
available as array methods, i.e. ``x = np.array([1,2,3]); x.sort()``.
Exceptions to this rule are documented.

In [183]:
v.sum()

6

In [184]:
v.min()

1

In [185]:
v.max()

3

In [187]:
np.std(v, axis=0)

0.816496580927726

#### Numpy ile İki Bilinmeyenli Denklem Çözümü

In [188]:
import numpy as np

$ 5 * x_0 + x_1 = 12 $ \
$ x_0 + 3 * x_1 = 10 $

In [189]:
a = np.array([[5,1], [1,3]])
b = np.array([12,10])

In [190]:
a

array([[5, 1],
       [1, 3]])

In [191]:
b

array([12, 10])

In [194]:
x = np.linalg.solve(a,b)
x

array([1.85714286, 2.71428571])

## Pandas 

Panel Data 

Yapısal veri setleri ile esnek çalışmayı sağlar. 

- veri manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir Python kütüphanesidir
- Ekonometrik ve finansal çalışmalar için doğmuştur. 
- Temeli 2008 yılında atılmıştır
- R DataFrame yapısını Python dünyasına taşımış ve DataFrame'ler üzerinde hızlı ve etkili çalışabilme imkanı sağlamıştır. 
- Birçok farklı veri tipi okuma ve yazma işlemi sağlar.

#### Pandas Serisi Oluşturmak

In [198]:
import pandas as pd

In [199]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [200]:
seri = pd.Series([1,2,3,4,5])

In [201]:
type(seri)

pandas.core.series.Series

In [202]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [203]:
seri.dtype

dtype('int64')

In [205]:
seri.size

5

In [206]:
seri.ndim

1

In [207]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [208]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [210]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [211]:
# index isimlendirmesi

In [214]:
pd.Series([99,22,3,44,33], index = [1,3,5,7,9])

1    99
3    22
5     3
7    44
9    33
dtype: int64

In [215]:
pd.Series([99,22,3,44,33], index = ["a","b","c","d","e"])

a    99
b    22
c     3
d    44
e    33
dtype: int64

In [216]:
seri = pd.Series([99,22,3,44,33], index = ["a","b","c","d","e"])

In [218]:
seri["a"]

99

In [219]:
# sozluk üzerinden liste oluşturmak

In [220]:
sozluk = {"reg":10, "log":11, "cart":12}

In [221]:
seri = pd.Series(sozluk)

In [222]:
seri

reg     10
log     11
cart    12
dtype: int64

In [223]:
# iki seriyi birleştirerek seri olusturma

In [224]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

#### Serilerde Eleman İşlemleri

In [226]:
import numpy as np
a = np.array([1,2,33,44,55])
seri = pd.Series(a)
seri

0     1
1     2
2    33
3    44
4    55
dtype: int32

In [227]:
seri[0]

1

In [228]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [229]:
seri = pd.Series([10,20,30,45], index = ["abc","def","ghj","klm"])

In [230]:
seri

abc    10
def    20
ghj    30
klm    45
dtype: int64

In [231]:
seri.index

Index(['abc', 'def', 'ghj', 'klm'], dtype='object')

In [232]:
seri.keys

<bound method Series.keys of abc    10
def    20
ghj    30
klm    45
dtype: int64>

In [233]:
list(seri.items())

[('abc', 10), ('def', 20), ('ghj', 30), ('klm', 45)]

In [234]:
seri.values

array([10, 20, 30, 45], dtype=int64)

In [236]:
# eleman sorgulama

"abc" in seri

True

In [237]:
"a" in seri

False

In [239]:
seri["abc"]

10

In [240]:
#fancy eleman

seri[["abc", "def"]]

abc    10
def    20
dtype: int64

In [242]:
seri["abc"] = 100

In [243]:
seri["abc"]

100

In [244]:
seri["abc":"klm"]

abc    100
def     20
ghj     30
klm     45
dtype: int64

### Pandas DataFrame Oluşturma

In [245]:
import pandas as pd

In [246]:
l = [1,2,3,45,50,60]

In [247]:
l

[1, 2, 3, 45, 50, 60]

In [249]:
pd.DataFrame(l,columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3             45
4             50
5             60

In [251]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [252]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [253]:
#df isimlendirme

In [254]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [255]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [256]:
df.columns = ("deg1", "deg2", "deg3")

In [257]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [258]:
type(df)

pandas.core.frame.DataFrame

In [269]:
# index bilgisi ve değişken ismi satır ve sutun
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [260]:
df.shape

(3, 3)

In [261]:
df.ndim

2

In [262]:
df.size

9

In [263]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [264]:
type(df.values)

numpy.ndarray

In [265]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [266]:
a = np.array([1,2,3,4])

In [268]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4

#### Pandas DataFrame için Eleman İşlemleri

In [270]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [271]:
sozluk = {"var": s1, "var2": s2, "var3": s3}

In [272]:
sozluk

{'var': array([4, 9, 2, 3, 7]),
 'var2': array([8, 3, 6, 1, 6]),
 'var3': array([7, 8, 2, 4, 7])}

In [274]:
df = pd.DataFrame(sozluk)

In [275]:
df

   var  var2  var3
0    4     8     7
1    9     3     8
2    2     6     2
3    3     1     4
4    7     6     7

In [276]:
df[0:1]

   var  var2  var3
0    4     8     7

In [277]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [278]:
df.index = ["a","b","c","d","e"]

In [279]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [281]:
df["c":"e"]

   var  var2  var3
c    2     6     2
d    3     1     4
e    7     6     7

In [285]:
#silme (kalıcı olması için inplace = True kullan)

In [283]:
df.drop("a", axis = 0)

   var  var2  var3
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [284]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [286]:
#fancy ile birden fazla silme

In [287]:
l = ["c","e"]

In [288]:
df.drop(l, axis = 0 )

   var  var2  var3
a    4     8     7
b    9     3     8
d    3     1     4

In [289]:
#değişkenler için

In [290]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [292]:
"var" in df

True

In [293]:
l = [ "var", "var4", "var2"]

In [294]:
for i in l:
    print(i in df)

True
False
True

In [295]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [300]:
# bu değişkeni ekliyor 

df["var4"] = df["var"] / df["var"]

In [301]:
df["var4"]

a    1.0
b    1.0
c    1.0
d    1.0
e    1.0
Name: var4, dtype: float64

In [302]:
df

   var  var2  var3  var4
a    4     8     7   1.0
b    9     3     8   1.0
c    2     6     2   1.0
d    3     1     4   1.0
e    7     6     7   1.0

In [304]:
#değişken silmek

df.drop("var4", axis = 1, inplace = True)

In [305]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

In [306]:
#fancy ile silmek 

l= ["var","var2"]
df.drop(l, axis = 1)

   var3
a     7
b     8
c     2
d     4
e     7

In [307]:
df

   var  var2  var3
a    4     8     7
b    9     3     8
c    2     6     2
d    3     1     4
e    7     6     7

#### Gözlem ve Değişken Seçimi: Loc & iloc

In [308]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size =(10,3))
df = pd.DataFrame(m, columns = ["var1", "var2","var3"])
df

   var1  var2  var3
0    27     8     7
1     6     3     9
2    16    12     3
3     5    22    25
4    16    14     5
5    22     1    17
6    15    16    16
7    11    16    22
8    19     2    25
9    29    20    29

In [309]:
# loc: Tanımlandığı şekli ile seçim yapmak için kullanılır. (3dahil seçiyor, indexte yazdığı gibi)

In [310]:
df.loc[0:3]

   var1  var2  var3
0    27     8     7
1     6     3     9
2    16    12     3
3     5    22    25

In [311]:
# iloc: alışık olduğumuz indexleme mantığı ile seçim yapar (3'e kadar seçiyor)

In [312]:
df.iloc[0:3]

   var1  var2  var3
0    27     8     7
1     6     3     9
2    16    12     3

In [313]:
df.iloc[0,0]

27

In [314]:
df.iloc[:3,:2]

   var1  var2
0    27     8
1     6     3
2    16    12

In [315]:
df.loc[0:3,"var3"]

0     7
1     9
2     3
3    25
Name: var3, dtype: int32

In [316]:
df.iloc[0:3]["var3"]

0    7
1    9
2    3
Name: var3, dtype: int32

### Koşullu Elaman İşlemleri

In [326]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size =(10,3))
df = pd.DataFrame(m, columns = ["var1", "var2","var3"])
df

   var1  var2  var3
0    25    14    18
1    16    18    18
2    11    23    18
3    23    15    27
4    23     3    22
5     7     4     3
6    14    19    12
7    18     9    14
8     4    24    25
9    12     5    26

In [327]:
df[df.var1 > 15]

   var1  var2  var3
0    25    14    18
1    16    18    18
3    23    15    27
4    23     3    22
7    18     9    14

In [333]:
#birden fazla koşul 

df[(df.var1 < 10) & (df.var3 > 20)]

   var1  var2  var3
8     4    24    25

### Birleştirme (Join) İşlemleri

In [334]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size =(10,3))
df1 = pd.DataFrame(m, columns = ["var1", "var2","var3"])
df1

   var1  var2  var3
0    19    14    26
1    20    20    26
2    19     5     4
3     9    27    20
4    24    27    15
5    22     6    22
6     4     6    14
7    18     8     2
8    16    23    16
9    22    26    21

In [335]:
df2 = df1 + 99 
df2

   var1  var2  var3
0   118   113   125
1   119   119   125
2   118   104   103
3   108   126   119
4   123   126   114
5   121   105   121
6   103   105   113
7   117   107   101
8   115   122   115
9   121   125   120

In [337]:
#index sıraya dikkat tekrar ediyor 

pd.concat([df1,df2])

   var1  var2  var3
0    19    14    26
1    20    20    26
2    19     5     4
3     9    27    20
4    24    27    15
5    22     6    22
6     4     6    14
7    18     8     2
8    16    23    16
9    22    26    21
0   118   113   125
1   119   119   125
2   118   104   103
3   108   126   119
4   123   126   114
5   121   105   121
6   103   105   113
7   117   107   101
8   115   122   115
9   121   125   120

In [338]:
#index sıralamasını düzeltmek için

pd.concat([df1,df2], ignore_index=True)

    var1  var2  var3
0     19    14    26
1     20    20    26
2     19     5     4
3      9    27    20
4     24    27    15
5     22     6    22
6      4     6    14
7     18     8     2
8     16    23    16
9     22    26    21
10   118   113   125
11   119   119   125
12   118   104   103
13   108   126   119
14   123   126   114
15   121   105   121
16   103   105   113
17   117   107   101
18   115   122   115
19   121   125   120

In [340]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [342]:
df2.columns = ["var1", "var2", "deg3"]

In [343]:
df2

   var1  var2  deg3
0   118   113   125
1   119   119   125
2   118   104   103
3   108   126   119
4   123   126   114
5   121   105   121
6   103   105   113
7   117   107   101
8   115   122   115
9   121   125   120

In [344]:
# sutun ismi değişince hata veriyor, birleştiremiyor çünkü aynı bilgiyi taşımıyor. 

pd.concat([df1, df2])

   var1  var2  var3   deg3
0    19    14  26.0    NaN
1    20    20  26.0    NaN
2    19     5   4.0    NaN
3     9    27  20.0    NaN
4    24    27  15.0    NaN
5    22     6  22.0    NaN
6     4     6  14.0    NaN
7    18     8   2.0    NaN
8    16    23  16.0    NaN
9    22    26  21.0    NaN
0   118   113   NaN  125.0
1   119   119   NaN  125.0
2   118   104   NaN  103.0
3   108   126   NaN  119.0
4   123   126   NaN  114.0
5   121   105   NaN  121.0
6   103   105   NaN  113.0
7   117   107   NaN  101.0
8   115   122   NaN  115.0
9   121   125   NaN  120.0

In [346]:
# cozmek için, kesişim dışındakileri almıyoruz. 

pd.concat([df1, df2], join = "inner")

   var1  var2
0    19    14
1    20    20
2    19     5
3     9    27
4    24    27
5    22     6
6     4     6
7    18     8
8    16    23
9    22    26
0   118   113
1   119   119
2   118   104
3   108   126
4   123   126
5   121   105
6   103   105
7   117   107
8   115   122
9   121   125

In [353]:
pd.concat([df1, df2.reindex(columns = df1.columns)], ignore_index = True)

    var1  var2  var3
0     19    14  26.0
1     20    20  26.0
2     19     5   4.0
3      9    27  20.0
4     24    27  15.0
5     22     6  22.0
6      4     6  14.0
7     18     8   2.0
8     16    23  16.0
9     22    26  21.0
10   118   113   NaN
11   119   119   NaN
12   118   104   NaN
13   108   126   NaN
14   123   126   NaN
15   121   105   NaN
16   103   105   NaN
17   117   107   NaN
18   115   122   NaN
19   121   125   NaN

### İleri Birleştirme İşlemleri

In [354]:
import pandas as pd

In [355]:
#birebir birleştirme

In [356]:
df1 = pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                    "grup":["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [357]:
df2 = pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                    "ilk_giris": [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [358]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [359]:
#veya 

pd.merge(df1, df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [360]:
#coktan teke

df3 = pd.merge(df1,df2)

In [362]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [366]:
df4 = pd.DataFrame({"grup":["Muhasebe","Muhendislik","IK"],
                    "mudur": ["Caner", "Mustafa", "Berkcan"]})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [367]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           IK       2019  Berkcan

In [368]:
# çoktan çoka / many to many

In [369]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik",
                             "Muhendislik", "IK", "IK" ],
                    "yetenekler": ["matematik", "excel", "kodalama", 
                                   "linux", "excel", "yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik   kodalama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [370]:
#çoklama oluyor burada / şimdilik goz ardı ediyoruz. 

pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik   kodalama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik   kodalama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

### Gruplama ve Toplulaştırma / Grouping & Aggregation

**Basit toplulaştırma fonksiyonları:**

- count()
- first()
- last()
- mean()
- median()
- min()
- max()
- std()
- var()
- sum()

In [373]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [375]:
df.shape

(1035, 6)

In [379]:
df["mass"].mean()

2.6381605847953233

In [381]:
df["mass"].count()

513

In [383]:
#tek tek yapmak yerine 

df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [384]:
#içindeki eksik değerleri silip bakmak için

df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

**Gruplama**

In [395]:
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "veri": [10,11,52,23,43,55]}, columns= ["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [396]:
df.groupby("gruplar")

In [397]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [398]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [399]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [400]:
df.groupby("method")

In [401]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [402]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [405]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                   "degisken1": [10,11,52,23,43,55], 
                   "degisken2": [100,211,252,233,423,555]}, 
                    columns= ["gruplar", "degisken1","degisken2"])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        211
2       C         52        252
3       A         23        233
4       B         43        423
5       C         55        555

In [406]:
#aggregate

In [407]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.5      166.5
B             27.0      317.0
C             53.5      403.5

In [408]:
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.5  23       100  166.5  233
B              11   27.0  43       211  317.0  423
C              52   53.5  55       252  403.5  555

In [409]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        233
B               11        423
C               52        555

In [419]:
#filter

def filter_func(x):
    return x["degisken1"].std() > 10

In [415]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         9.192388   94.045202
B        22.627417  149.906638
C         2.121320  214.253355

In [420]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
1       B         11        211
4       B         43        423

In [421]:
#Transform

In [422]:
# verinin değişken üzerinde kendi tanımladığımız bir değişiklik yapmak

In [423]:
df_a = df.iloc[:,1:3]

In [425]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -1.101533  -1.191870
1  -1.052210  -0.515732
2   0.970006  -0.265988
3  -0.460342  -0.381723
4   0.526105   0.775629
5   1.117974   1.579685

In [426]:
#apply

In [427]:
import pandas as pd
df = pd.DataFrame({"degisken1": [10,11,52,23,43,55], 
                   "degisken2": [100,211,252,233,423,555]}, 
                    columns= ["degisken1","degisken2"])

df

   degisken1  degisken2
0         10        100
1         11        211
2         52        252
3         23        233
4         43        423
5         55        555

In [428]:
df.apply(np.sum)

degisken1     194
degisken2    1774
dtype: int64

In [429]:
df.apply(np.mean)

degisken1     32.333333
degisken2    295.666667
dtype: float64

### Pivot Tablolar

In [430]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [432]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [433]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [435]:
# pivot ile table

In [436]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [437]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [439]:
age = pd.cut(titanic["age"], [0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [440]:
titanic.pivot_table("survived",  ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

### Dış Kaynaklı Veri okumak

In [441]:
import pandas as pd

In [443]:
# csv okuma

pd.read_csv("reading_data-master/ornekcsv.csv", sep= ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [444]:
#txt okuma 

pd.read_csv("reading_data-master/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [457]:
df = pd.read_excel("reading_data-master/ornekx.xlsx")

In [458]:
type(df)

pandas.core.frame.DataFrame

In [459]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [460]:
df.columns = ("A", "B", "C")

In [461]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0